Revit 2027 API
ParameterTypeId.CouplerMainEndtreatment Property
 "End Treatment 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerMainEndtreatment { get; }
Public Shared ReadOnly Property CouplerMainEndtreatment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerMainEndtreatment {
	ForgeTypeId^ get ();
}
static member CouplerMainEndtreatment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace